Tekla Open API Reference for Tekla Structures 2025
ElementBase.GetUnformattedString Method
 Returns the content as a string without formatting.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract string GetUnformattedString()
Public MustOverride Function GetUnformattedString As String
Return Value
Type: String
The content as a string without formatting.
See Also
Reference
ElementBase Class
Tekla.Structures.Drawing Namespace